import React from 'react';
import { connect } from 'react-redux';
import { Themes } from 'models/theme';
import styles from './styles.less';

const Page = props => {
  const { theme } = props;
  const themeText = theme === Themes.DARK ? '暗色' : '亮色';
  return (
    <div className={styles.root}>
      <h1 className={styles.h}>{themeText}</h1>
      <p className={styles.p}>
        和吃對，出害覺盡大人。病當好，的見體保布小倒結王民定國往！總案行關小頭像人。
        前出未的女全度易痛利像期是預險；動生學一小車定來，土活也，刻反道；策入不，心個獲票變人著也展人麼看級國：慢校度盡二便東奇是一子房十團當高需……權連得經教：速與先也題稱格頭好同的兩收前想；在黑成世裝公公中生直了臺起要日氣及重如修臺能美海排只詩希來地每達夜你：樓可兒習果……界解國不天到而生兒健動年球願較臺四家經們打體醫片美股備的老實能，畫找從？或新立製、的友學得、又不為三長上風還待竟雨解展品，多問與一比件要門只。文這一因的間說業王的西只整前個；的保文，知裡正是前開的非；明他不跑價，帶推在黃沒流年灣考統國看個名是影可業？不球營無：毛本交黑孩美的上裡不放事老人的結內創前列裝香位！過子神手形紅觀戰市圖書要細？包招子！時有下母場？天賣月算民與美然什的相？
        沒學委師意機是想破來，平又同麼小。洲嗎人靈打統面人學……比有求樣月明，呢此不音大點發日眼形門心布錯有個代想回設車一銷地自二類程。
      </p>
      <p className={styles.p}>
        山求已關港知例，健制全的，的論愛：個檢法像門題道資。會考價臺股著此基件們她安合且裝力一代康生心北物時慢會。一分運每形研，家選會成有異主容天德出因要賽他媽做就制頭點新不意多以希；麼我文大著，的愛最香方小這低母，天面有母。
        樹教生說紀過學時質呢年別容決。頭完史獲麼來也健突，推畫遠度門究人自機族？爸高的前步性！命期工平，醫兩優至……如座布機如夫很息計有電數？集當們二此收市辦要來有作盡巴理滿人地的主斯辦。
        黑後食少上成少：是動感到歡嚴因家場性產著一目子行事，圖案之學北聽聲洋。多費一國病；之停與收，營用？
        第聽下室者區看，臺為衣球年人。的的年不集他有自場法書加建，書士集靜有效部少投些意是土運他以集面等引機如加溫間我！不意賣意、金原又系票算麼公司想看戲，始麼不門到家我力易一能的年華了的看代因電行光事我今真獎自傷能早方：少他線人國出適音，公動頭和權候人山一我斯安進魚水三富，樣招強出毒會資美工業留其友有。的習保該福公設開成同我驗間來師造你會裡顯！
      </p>
    </div>
  );
};

const mapStateToProps = store => ({ theme: store.theme.theme });
export default connect(mapStateToProps)(Page);
